{"data":
[{"title": "3D Modeling and Animation","content": "During my time in high-school I was very fortunate to have the opportunity to study animation and motion graphics. It turned out to be something I really enjoy and continue to play around with when I have time.<br><br>During my final year, I spent 8 months working on a character design project. I had the opportunity to be taught advanced 3D modeling and sculpting techniques one-on-one by a motion editor from Weta Digital and chose to fully develop a model of my character for the project.<br><br>After several iterations and pages of feedback from Weta Digital and AUT's digital design department, my model was complete and ready to exhibit. The next two months of the year were spent on exhibition design and execution.<br><br>For my exhibition, I transformed a room into a small forest. Placing murals on the walls as well as covering the floor in a layer of dirt, bark, and twigs. Plinths and tables throughout the room featured 3D-printed versions of the model, prints of the model composited into different photographs were placed around the room, and a TV was placed along one wall playing a video of the entire development process for the model.<br><br>The final month of my time at school was spent developing a showreel, linked below.", "image": "3d-modeling.jpg", "link": [{"url": "https://vimeo.com/190177618", "img": "vimeo.svg"}]},
{"title": "Shielded", "content": "Shielded was my first large-scale project. Developed for a high-school assignment, Shielded is a prototype of an end-to-end encrypted messaging app.<br><br>While Shielded isn't polished and doesn't run on every device under the sun, it works. For an 18 year old that had never made more than basic scripts in Python, this was a big and exciting step forward for me.<br><br>Shielded uses PGP to encrypt messages in two layers. The message itself is encrypted so that only the recipient can read it (not even the server has access!) and then details such as the sender and recipient are encrypted to prevent interception between users and the server.", "image": "shielded.svg", "link": [{"url": "https://github.com/ConnorMattson/Shielded-Messaging-App", "img": "GitHub.svg"}]},
{"title": "Asteroids Point Control", "content": "For my first serious foray into JavaScript, I developed a local two player game based on Asteroids by Atari. Each player drives a ship around the asteroid field, avoiding asteroids and moving over points to take control of them. After a minute, the player with the most points controlled wins.", "image": "asteroids.svg", "link": [{"url": "https://github.com/ConnorMattson/Asteroids-Point-Control", "img": "GitHub.svg"}, {"url": "https://connormattson.github.io/Asteroids-Point-Control/", "img": "asteroidsLink.svg"}]},
{"title": "connormattson.github.io", "content": "I think every serious developer and designer needs a portfolio website. A standard resume may be fine for an accountant or receptionist, but when it's your job to build cool things, you have to show what you've done in the past.<br><br>Developing the website wasn't just a chance to make a digital resume. The development process forced me to consider my work from a new perspective and establish a brand identity for myself.", "image": "connor-mattson.svg", "link": [{"url": "https://github.com/ConnorMattson/ConnorMattson.github.io", "img": "GitHub.svg"}]},
{"title": "Greedy walks in pursuit of laziness", "content": "This is my submission for the 2017 ENGGEN 131 MATLAB project at The University of Auckland.<br><br>\"This project requires you to write code that will allow you to find the best path from one side of a map to the other, where the map is represented as a 2D array containing elevation data. For our purposes the best path is deemed to be the one where a person moving from the west side of the map to the east (or vice versa) would experience the smallest total change in elevation as they move along that path (where any increase or decrease in elevation is interpreted as a positive change).\"<br><br>Although the assignment was fairly basic, I really enjoyed the final stage of optimising functions to get extra marks for speed.<br>Functions had to run in under 10 seconds in order to earn maximum marks. My greedy and non-greedy functions ran in 0.25 and 0.005 seconds on average respectively - the fastest in our year.", "image": "greedy-walks.jpg", "link": [{"url": "https://github.com/ConnorMattson/ConnorMattson/Greedy-walks-in-pursuit-of-laziness", "img": "GitHub.svg"}]},
{"title": "Project Make", "content": "\"Learning to design is a complex activity requiring the collective knowledge and practices of the design community across all sectors and disciplines.<br>Project Make champions the role of design and design education in New Zealand and encourages folk to make things together.<br><br>We make things<br>We strive to make things well<br>We aspire to make things that matter<br><br>Ultimately, we want to make a difference. Together.\"<br><br>In addition to collaborating with Project Make on several of their initial events. I assisted Demelza Round, founder and director, in establishing sensible protocols and workflows for working with collaborators, students, educators, and industry experts.", "image": "project-make.svg", "link": [{"url": "http://project-make.com/", "img": "project-make-logo.svg"}]},
{"title": "Trace File Viewer", "content": "The University of Auckland Computer Science network lab hosts the Auckland Satellite Simulator<a href=\"http://sde.blogs.auckland.ac.nz/\">(http://sde.blogs.auckland.ac.nz/)</a>. It is used to simulate Internet traffic to small Pacific islands that are connected to the rest of the world via a satellite link.<br><br> On the island side of the satellite link, the simulator eavesdrops on the incoming packets. It stores summary information about each packet in a trace file. The trace file is plain text and each line contains the record for exactly one packet.<br><br>Trace File Viewer gets a graphical display of how much data comes from a particular source host over time, or how much data goes to a particular destination host over the course of an experiment.", "image": "trace-file-viewer.svg", "link": [{"url": "https://github.com/ConnorMattson/Trace-File-Viewer", "img": "GitHub.svg"}]},
{"title": "Waiheke Treehouse Retreat", "content": "The Waiheke Island Treehouse Retreat project features two accommodation pods nested in the tree canopy, connected with boardwalks, and a third pod sitting lower in the valley. The section falls away from road level steeply, making the third pod roughly seven metres above ground level.<br><br>The project directors were interested in a 3D model - produced from the existing technical drawings - giving a realistic representation of the site for reports and marketing.", "image": "treehouse-main.jpg"},
{"title": "Tyred", "content": "Simulating software development in a professional environment, Create Camp 2018 was a two-day hackathon run by Summer of Tech in which teams were challenged to create apps that make use of New Zealand API. My team created Tyred, which finds the most energy efficient route between two addresses. We were awarded prizes for the most hurdles overcome and the best collaboration.<br/><br/>I loved the experience of working on Tyred and since the hackathon I've been working on implementing all the features we talked about but didn't have time for!", "image": "TyredLogo.svg", "link": [{"url": "https://github.com/ConnorMattson/Tyred", "img": "GitHub.svg"}, {"url": "https://connormattson.github.io/Tyred/", "img": "TyredLogo.svg"}]},
{"title": "Challenge Solutions", "content": "A collection of random scripts and challenge solutions I've worked on over the years.<br/><br/>I love solving programming challenges or puzzles and competing in programming competitions. In this repo, I am keeping a record of solutions I've found. Over time I would like to properly document each of these solutions and build a database with the ability to try the code in browser.<br/><br/>The majority of problems were sourced from the New Zealand Programming Contest (NZPC).", "image": "problemSolutions.svg", "link": [{"url": "https://github.com/ConnorMattson/Misc-Scripts-and-Challenge-Solutions", "img": "GitHub.svg"}]}
], "format": {"title": "", "content": "", "image": "", "link": [{"url": "", "img": ""}]}}